bench/results/server1/apiary-0.15.0/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.41ms   55.99ms 923.31ms   99.40%
    Req/Sec     2.94k   658.24     7.86k    85.50%
  677612 requests in 30.00s, 115.03MB read
Requests/sec:  22584.21
Transfer/sec:      3.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.64ms    8.08ms 810.71ms   98.12%
    Req/Sec     2.90k   498.85     6.74k    83.93%
  674765 requests in 30.00s, 114.54MB read
Requests/sec:  22488.99
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.33ms   34.86ms 723.43ms   99.73%
    Req/Sec     2.90k   665.32     7.63k    81.17%
  674417 requests in 30.00s, 114.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:  22477.30
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.61ms    3.21ms 386.60ms   93.53%
    Req/Sec     2.92k   500.62     7.06k    86.14%
  672954 requests in 30.01s, 114.24MB read
Requests/sec:  22428.04
Transfer/sec:      3.81MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.53ms    1.98ms 170.38ms   89.02%
    Req/Sec     2.94k   736.27     7.50k    76.06%
  676921 requests in 30.00s, 114.91MB read
Requests/sec:  22562.84
Transfer/sec:      3.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.77ms   40.05ms 817.30ms   99.67%
    Req/Sec     2.91k   580.80     7.70k    84.83%
  675775 requests in 30.00s, 114.72MB read
Requests/sec:  22522.61
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.84ms   11.20ms 317.39ms   99.61%
    Req/Sec     2.95k   585.59     8.12k    84.41%
  680186 requests in 30.00s, 115.46MB read
Requests/sec:  22670.65
Transfer/sec:      3.85MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.58ms   40.34ms 821.21ms   99.72%
    Req/Sec     2.89k   713.16     7.58k    70.63%
  675353 requests in 30.00s, 114.64MB read
Requests/sec:  22510.56
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.50ms    5.66ms 595.86ms   97.65%
    Req/Sec     2.91k   613.26     6.23k    64.19%
  677153 requests in 29.99s, 114.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 34
Requests/sec:  22576.85
Transfer/sec:      3.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.43ms    2.46ms 169.54ms   85.87%
    Req/Sec     2.96k   616.01     7.17k    82.20%
  673803 requests in 30.00s, 114.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:  22457.46
Transfer/sec:      3.81MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.0
bench:        PARAM
bench mode:   30s * 10
average:      22527.95
stdev:        71.88
=================== oneline ===================
7.8.2,apiary-0.15.0,PARAM,30s,10,22527.95,71.88